const int begin_count = 8;
const int max_line_size = 100;
const char begin[][max_line_size] = {"Нетрудно догадаться, что эта формула",
                                     "Всякому здравомыслящему человеку очевидно",
                                     "Нетрудно догадаться что",
                                     "Оставим это как упражнение читателю, что",
                                     "Даже второкласнику очевидно, что",
                                     "Внимательный читатель давно понял, что",
                                     "Лежит на поверхности, что",
                                     "В 25 главе 15го подраздела Некрономикона сказано, что"};